export default defineI18nLocale(() => ({
  cookieConsent: {
    title: 'Використання файлів cookie',
    description:
      'Ми використовуємо файли cookie та подібні технології для покращення '
      + 'вашого досвіду та аналізу трафіку. '
      + 'Ви можете обрати, які категорії дозволити.',
    close: 'Закрити',
    currentState: 'Поточний вибір',
    details: {
      show: 'Показати деталі',
      hide: 'Сховати деталі',
      date: 'Дата згоди',
      id: 'Ваш ідентифікатор згоди',
    },
    actions: {
      allowAll: 'Дозволити всі',
      allowSelected: 'Дозволити вибрані',
      withdraw: 'Відкликати згоду',
      customize: 'Налаштувати',
      change: 'Змінити налаштування',
    },
    categories: {
      necessary: {
        title: 'Строго необхідні',
        description:
          'Ці файли cookie необхідні для роботи сайту і не можуть бути '
          + 'вимкнені. Вони встановлюються у відповідь на ваші дії, '
          + 'наприклад налаштування конфіденційності або вхід в систему.',
      },
      preferences: {
        title: 'Налаштування',
        description:
          'Ці файли cookie дозволяють сайту запам\'ятовувати ваш вибір, '
          + 'наприклад мову або регіон, та надавати розширені '
          + 'персоналізовані функції.',
      },
      analytics: {
        title: 'Аналітика',
        description:
          'Ці файли cookie допомагають нам зрозуміти, як відвідувачі '
          + 'взаємодіють із сайтом, збираючи та надаючи інформацію '
          + 'анонімно. Вони дозволяють нам покращувати наш сервіс.',
      },
      marketing: {
        title: 'Маркетинг',
        description:
          'Ці файли cookie використовуються для відстеження відвідувачів '
          + 'на різних сайтах з метою показу релевантної реклами. Вони '
          + 'допомагають нам оцінити ефективність маркетингових кампаній.',
      },
    },
  },
}))
